wcm/widget/Convidado/src/main/webapp/resources/js/xml/ECMCardService_updateCardData.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.dm.ecm.technology.totvs.com/">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:updateCardData>
            <companyId></companyId>
            <username></username>
            <password></password>
            <cardId></cardId>
            <cardData>
                <item>
                    <field>nota1</field>
                    <value name="nota1"></value>
                </item>
                <item>
                    <field>nota2</field>
                    <value name="nota2"></value>
                </item>
                <item>
                    <field>comentario1</field>
                    <value name="coment"></value>
                </item>
            </cardData>
        </ws:updateCardData>
    </soapenv:Body>
</soapenv:Envelope>